In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:

dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.367194  0.526115
1  X   beta -1.550829  0.886339
2  Y  alpha  0.404913 -0.398885
3  Y   beta  1.264184 -0.917026
4  Z  alpha  0.107477  1.192392

In [8]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [10]:
group1

In [11]:
group1.mean()

k1
X   -0.959012
Y    0.834549
Z    0.107477
Name: dataset1, dtype: float64

In [19]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.367194  0.526115
1  X   beta -1.550829  0.886339
2  Y  alpha  0.404913 -0.398885
3  Y   beta  1.264184 -0.917026
4  Z  alpha  0.107477  1.192392

In [14]:
cities = np.array(['NY','LA','LA','NY','NY'])

In [16]:
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [18]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -1.550829
    JAN    0.404913
NY  FEB    1.264184
    JAN   -0.129859
Name: dataset1, dtype: float64

In [20]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.959012  0.706227
Y   0.834549 -0.657956
Z   0.107477  1.192392

In [21]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.367194  0.526115
   beta  -1.550829  0.886339
Y  alpha  0.404913 -0.398885
   beta   1.264184 -0.917026
Z  alpha  0.107477  1.192392

In [22]:
dframe.groupby('k1').size()

k1
X    2
Y    2
Z    1
dtype: int64

In [28]:
for name,group in dframe.groupby('k1'):
  print('This is the {} group'.format(name))
  print(group)
  print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -0.367194  0.526115
1  X   beta -1.550829  0.886339


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  0.404913 -0.398885
3  Y   beta  1.264184 -0.917026


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  0.107477  1.192392

In [33]:
gr = dframe.groupby('k1')

In [34]:
gr.get_group('X')

  k1     k2  dataset1  dataset2
0  X  alpha -0.367194  0.526115
1  X   beta -1.550829  0.886339

In [35]:
dframe.groupby('k1')

In [36]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [37]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.367194  0.526115
 1 -1.550829  0.886339
 2  0.404913 -0.398885
 3  1.264184 -0.917026
 4  0.107477  1.192392, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}